{"pageProps":{"post":{"attributes":{},"html":"<h2 id=\"who-is-this-for\">Who is this for?</h2>\n<p>This workshop is for anyone who is interested in learning how to use TypeScript with React.</p>\n<p>There is <strong>no expectation</strong> that you&#39;re familiar with TypeScript. That said, we&#39;re not going to be covering the basics of TypeScript directly.</p>\n<p>And, I&#39;m going to argue that&#39;s totally okay. Instead, we&#39;ll be learning it within the context of building simple components in React. You might even want to dig deeper into TypeScript after seeing some of the more advanced bits in practice first. That&#39;s how it worked for me at least.</p>\n<p>If you <em>are</em> already super comfortable with TypeScript, I have a suspicion that you&#39;ll pick up a few tips and tricks along the way—and there are plenty of React-specific pieces that I suspect you&#39;re get a lot of value from. Additionally, I also hope that it will reinforce the fundamentals for you.</p>\n<h2 id=\"why-should-i-take-this-workshop\">Why should I take this workshop?</h2>\n<p>I think I took my first run at TypeScript like two years ago. I definitely saw the value, but it also had a learning curve that was slowing me down a bit. I tried it—and Flow—for a spin a few more times over the years.</p>\n<p>At first, there was a copy of copy and pasting, flailing wildly and pulling your hair and a liberal use of the <code>any</code> type.</p>\n<p>One of the points that I&#39;m going to try to make in this workshop is that the developer exeperience is just <em>that</em> much better. I totally get that when you&#39;re first diving in, it can be overwhelming, but the very first time that you are in the middle of a reasonably-sized reactor and as soon as you appease the compiler, it just works—you&#39;ll be sold.</p>\n<p>As soon as the compiler catches a silly little mistake that might have slipped by your teammates and your tests—you&#39;ll be sold. Most of the time when it seems like TypeScript is being pendantic, it&#39;s usually just trying to save you from yourself. It&#39;s like pair programming with someone who doesn&#39;t talk too much.</p>\n<p>But, here are the quick soundbyte versions that you&#39;ll probably find in every other blog post on the Internet.</p>\n<ul>\n<li><strong>Type checking at <em>compile time</em></strong> is way better than things crashing or—worse—behaving unexpectedly at run time.</li>\n<li>You get a <strong>better development experience</strong> (read: autocomplete and/or Intellisense) because autocomplete knows more about what you’re intending on doing.</li>\n<li><strong>Large codebases stay more maintainable</strong> because you’re able to put guardrails on how your code can be used. It&#39;s easy to make some quip about your teammates, but we all know that the real culprit is that one last commit you tried to squeeze in at the end of day.<ul>\n<li>But also, the upside of having a compiler that can constantly scan an increasingly growing codebase at lightning speed can&#39;t be understated.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"whats-about-to-go-down\">What&#39;s about to go down?</h2>\n<p>We&#39;re going to spend a little bit starting with the <em>very basics</em> of using TypeScript and React together. Part of this is in case this is your first experience with TypeScript. Part of this is because I want to lay down a decently solid foundation and make sure we&#39;re all on the same page. But, part of this is because I want to establish this <strong>core principle</strong>.</p>\n<blockquote>\n<p>Sometimes the best way to figure out how to use TypeScript in a React application is to use the tooling while you&#39;re building our your React application.</p>\n</blockquote>\n<p>Theory is great and you should totally learn the fundamentals but there is nothing like using the thing you&#39;re building to learn more about the tools you&#39;re buidling with and I want to argue that <em>in this particular case</em> the tooling is <em>particularly</em> great way to learn about how to use TypeScript in React.</p>\n<p>But, by the end things are going to escalate to implementing some very advanced patterns that typically leave our friends who didn&#39;t make the investment getting the fundamentals to want to throw in the towel. We&#39;re going to stop short of the <em>really academic</em> stuff that is probably only useful to people building <em>super generalized</em> libraries that are intended for a wide-range of use cases. (Types for libraries like <a href=\"https://github.com/DefinitelyTyped/DefinitelyTyped\">Styled Components</a>, design systems like <a href=\"https://github.com/mui/material-ui\">Material U</a>, and <a href=\"https://github.com/DefinitelyTyped/DefinitelyTyped\">React&#39;s own types</a> come to mind.) In practice, I&#39;ve needed some of these patterns far less often than a lot of blog posts would seem to suggest.</p>\n<p>Here is the high level:</p>\n<ul>\n<li>Things are going to start fairly simply for those of us who have used React before. We&#39;ll be passing props into components and setting some state.</li>\n<li>By the end of our time together we&#39;ll be dynamically typing extending the built-in types for DOM elements that we know and—sometimes—love. adding type safety—and more importatly, autocomplete—to higher-order components, and creating type guards that prevent our components from ending up in unexpected states.</li>\n</ul>\n<h2 id=\"getting-set-up\">Getting set up</h2>\n<p>You don&#39;t need a lot to get rocking and/or rolling with this workshop. In fact, most of the examples and exercises have here and i will demonstarte with code.</p>\n<p>But, let&#39;s assume that you also want to work on some of this stuff locally as well. In that case, you&#39;re going to want to have the following installed:</p>\n<ul>\n<li><a href=\"https://nodejs.org/\">NodeJS</a>. This workshop was tested using the latest LTS release of Node at the time (e.g. 18.12.1), but it honestly shouldn&#39;t matter much.</li>\n<li>You&#39;re going to need an editor of some kind. I <strong>highly recommend</strong> using <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a>. But, you likely already have opinions on this topic—but that&#39;s going to be what I&#39;m using.</li>\n</ul>\n<h2 id=\"my-set-up\">My set up</h2>\n<p>In case you&#39;re morbidly curious about what I&#39;m using as we spend the next several hours together, here is a quick rundown of my setup.</p>\n<ul>\n<li><p><strong>Font</strong>: <a href=\"https://github.com/tonsky/FiraCode\">Dank mono</a>. It&#39;s basically a version of mono  but with fancy ligatures. Why? Because it looked nice when I saw in like 2015 and I&#39;m <em>very</em> lazy.</p>\n</li>\n<li><p><strong>Theme</strong>: <a href=\"https://marketplace.visualstudio.com/items?itemName=sdras.night-owl\">Night Owl</a></p>\n</li>\n<li><p><strong>Plugins</strong>: I don&#39;t install a lot of plugins, but here are some of the ones that I like:  <a href=\"https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode\">Prettier</a>. <a href=\"https://marketplace.visualstudio.com/items?itemName=dbaeumer.vscode-eslint\">Eslint</a></p>\n</li>\n</ul>\n<h2 id=\"who-am-i\">Who am I?</h2>\n<p>Hello! My name is <a href=\"https://stevekinney.net/\">Prashant Rawal</a> and I am a Team Lead at <a href=\"https://www.tridhyatech.com/\">Tridhya Tech</a>. we help in End-to-end Digital Transformation Enabled for Enterprises.</p>\n<p>In the past, I was the Scientist B at <a href=\"https://www.isro.gov.in/\">ISRO</a> and was the Senior software Engineer at <a href=\"https://tecxar.io/\">tecxar pvt ltd</a>.before that i have worked in various other service based companies too like <a href=\"https://www.intuz.com/\">Intuz</a>\nand <a href=\"https://riviatechs.com/\">riviatechke</a></p>\n<p>I live in Ahmedabad, gujrat. If you are so inclined to find me on the Internet, you may do so at the following locations:</p>\n<ul>\n<li><a href=\"https://github.com/IAmCuriousDeveloper\">Github</a></li>\n<li><a href=\"https://instagram.com/leaderwithoutatitle?igshid=MTNiYzNiMzkwZA==\">Instagram</a></li>\n</ul>\n<p>Alright, with all of that out of the way, <strong>let&#39;s get started</strong></p>\n","markdown":"## Who is this for?\n\nThis workshop is for anyone who is interested in learning how to use TypeScript with React.\n\nThere is **no expectation** that you're familiar with TypeScript. That said, we're not going to be covering the basics of TypeScript directly.\n\nAnd, I'm going to argue that's totally okay. Instead, we'll be learning it within the context of building simple components in React. You might even want to dig deeper into TypeScript after seeing some of the more advanced bits in practice first. That's how it worked for me at least.\n\nIf you _are_ already super comfortable with TypeScript, I have a suspicion that you'll pick up a few tips and tricks along the way—and there are plenty of React-specific pieces that I suspect you're get a lot of value from. Additionally, I also hope that it will reinforce the fundamentals for you.\n\n## Why should I take this workshop?\n\nI think I took my first run at TypeScript like two years ago. I definitely saw the value, but it also had a learning curve that was slowing me down a bit. I tried it—and Flow—for a spin a few more times over the years.\n\nAt first, there was a copy of copy and pasting, flailing wildly and pulling your hair and a liberal use of the `any` type.\n\nOne of the points that I'm going to try to make in this workshop is that the developer exeperience is just _that_ much better. I totally get that when you're first diving in, it can be overwhelming, but the very first time that you are in the middle of a reasonably-sized reactor and as soon as you appease the compiler, it just works—you'll be sold.\n\nAs soon as the compiler catches a silly little mistake that might have slipped by your teammates and your tests—you'll be sold. Most of the time when it seems like TypeScript is being pendantic, it's usually just trying to save you from yourself. It's like pair programming with someone who doesn't talk too much.\n\nBut, here are the quick soundbyte versions that you'll probably find in every other blog post on the Internet.\n\n- **Type checking at _compile time_** is way better than things crashing or—worse—behaving unexpectedly at run time.\n- You get a **better development experience** (read: autocomplete and/or Intellisense) because autocomplete knows more about what you’re intending on doing.\n- **Large codebases stay more maintainable** because you’re able to put guardrails on how your code can be used. It's easy to make some quip about your teammates, but we all know that the real culprit is that one last commit you tried to squeeze in at the end of day.\n  - But also, the upside of having a compiler that can constantly scan an increasingly growing codebase at lightning speed can't be understated.\n\n## What's about to go down?\n\nWe're going to spend a little bit starting with the _very basics_ of using TypeScript and React together. Part of this is in case this is your first experience with TypeScript. Part of this is because I want to lay down a decently solid foundation and make sure we're all on the same page. But, part of this is because I want to establish this **core principle**.\n\n> Sometimes the best way to figure out how to use TypeScript in a React application is to use the tooling while you're building our your React application.\n\nTheory is great and you should totally learn the fundamentals but there is nothing like using the thing you're building to learn more about the tools you're buidling with and I want to argue that _in this particular case_ the tooling is _particularly_ great way to learn about how to use TypeScript in React.\n\nBut, by the end things are going to escalate to implementing some very advanced patterns that typically leave our friends who didn't make the investment getting the fundamentals to want to throw in the towel. We're going to stop short of the _really academic_ stuff that is probably only useful to people building _super generalized_ libraries that are intended for a wide-range of use cases. (Types for libraries like [Styled Components](https://github.com/DefinitelyTyped/DefinitelyTyped), design systems like [Material U](https://github.com/mui/material-ui), and [React's own types](https://github.com/DefinitelyTyped/DefinitelyTyped) come to mind.) In practice, I've needed some of these patterns far less often than a lot of blog posts would seem to suggest.\n\nHere is the high level:\n\n- Things are going to start fairly simply for those of us who have used React before. We'll be passing props into components and setting some state.\n- By the end of our time together we'll be dynamically typing extending the built-in types for DOM elements that we know and—sometimes—love. adding type safety—and more importatly, autocomplete—to higher-order components, and creating type guards that prevent our components from ending up in unexpected states.\n\n## Getting set up\n\nYou don't need a lot to get rocking and/or rolling with this workshop. In fact, most of the examples and exercises have here and i will demonstarte with code.\n\nBut, let's assume that you also want to work on some of this stuff locally as well. In that case, you're going to want to have the following installed:\n\n- [NodeJS](https://nodejs.org/). This workshop was tested using the latest LTS release of Node at the time (e.g. 18.12.1), but it honestly shouldn't matter much.\n- You're going to need an editor of some kind. I **highly recommend** using [Visual Studio Code](https://code.visualstudio.com/). But, you likely already have opinions on this topic—but that's going to be what I'm using.\n\n## My set up\n\nIn case you're morbidly curious about what I'm using as we spend the next several hours together, here is a quick rundown of my setup.\n\n- **Font**: [Dank mono](https://github.com/tonsky/FiraCode). It's basically a version of mono  but with fancy ligatures. Why? Because it looked nice when I saw in like 2015 and I'm _very_ lazy.\n\n- **Theme**: [Night Owl](https://marketplace.visualstudio.com/items?itemName=sdras.night-owl)\n\n- **Plugins**: I don't install a lot of plugins, but here are some of the ones that I like:  [Prettier](https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode). [Eslint](https://marketplace.visualstudio.com/items?itemName=dbaeumer.vscode-eslint)\n\n## Who am I?\n\nHello! My name is [Prashant Rawal](https://stevekinney.net/) and I am a Team Lead at [Tridhya Tech](https://www.tridhyatech.com/). we help in End-to-end Digital Transformation Enabled for Enterprises.\n\nIn the past, I was the Scientist B at [ISRO](https://www.isro.gov.in/) and was the Senior software Engineer at [tecxar pvt ltd](https://tecxar.io/).before that i have worked in various other service based companies too like [Intuz](https://www.intuz.com/)\nand [riviatechke](https://riviatechs.com/)\n\nI live in Ahmedabad, gujrat. If you are so inclined to find me on the Internet, you may do so at the following locations:\n\n- [Github](https://github.com/IAmCuriousDeveloper)\n- [Instagram](https://instagram.com/leaderwithoutatitle?igshid=MTNiYzNiMzkwZA==)\n\nAlright, with all of that out of the way, **let's get started**\n","slug":"why","title":"Why","section":"About Workshop and Me","icon":"dumpster-fire","filePath":"/home/runner/work/React-with-TypeScript/React-with-TypeScript/lessons/02-about-workshop-and-me/A-why.md","nextSlug":"/React-with-TypeScript/lessons/PropTypes/nameBadge","prevSlug":"/React-with-TypeScript/lessons/introduction/intro"}},"__N_SSG":true}